---
title: AnalyticalEquipmentLoadData
classe: Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# AnalyticalEquipmentLoadData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double ApparentLoad { get; set; }` | `analyticalEquipmentLoadData.ApparentLoad` | Double |
| `Double Current { get; }` | `analyticalEquipmentLoadData.Current` | Double |
| `ElementId LoadClassification { get; set; }` | `analyticalEquipmentLoadData.LoadClassification` | ElementId |
| `ElementId LoadSet { get; set; }` | `analyticalEquipmentLoadData.LoadSet` | ElementId |
| `ElectricalLoadType LoadType { get; }` | `analyticalEquipmentLoadData.LoadType` | ElectricalLoadType |
| `Int32 PhasesNumber { get; set; }` | `analyticalEquipmentLoadData.PhasesNumber` | Int32 |
| `Double PowerFactor { get; set; }` | `analyticalEquipmentLoadData.PowerFactor` | Double |
| `PowerFactorStateType PowerFactorState { get; set; }` | `analyticalEquipmentLoadData.PowerFactorState` | PowerFactorStateType |
| `Double TrueLoad { get; }` | `analyticalEquipmentLoadData.TrueLoad` | Double |
| `Double Voltage { get; set; }` | `analyticalEquipmentLoadData.Voltage` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```